Revit 2024 API
FabricationPart.SetPositionByEnd Method
 Positions the connector of the fabrication part element by the passed point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void SetPositionByEnd(
	Connector connector,
	XYZ position
)
Visual Basic
Public Sub SetPositionByEnd ( _
	connector As Connector, _
	position As XYZ _
)
Visual C++
public:
void SetPositionByEnd(
	Connector^ connector,
	XYZ^ position
)
Parameters
connector
Type: Autodesk.Revit.DB.Connector
 The connector of the fabrication part element.
position
Type: Autodesk.Revit.DB.XYZ
 The position to move to.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  this operation failed.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace